# NotPositiveBendRadius Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..ElectricalFailures..::..NotPositiveBendRadius Property
BuiltInFailures..::..ElectricalFailures Class See Also
---
The value you entered for the bend radius is zero or a negative value. Enter a positive value.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId NotPositiveBendRadius { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property NotPositiveBendRadius As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ NotPositiveBendRadius {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..ElectricalFailures Class
Autodesk.Revit.DB Namespace